# 1. 產生 DataFrame
![](image\20210710-1.png)

## pd.DataFrame(data=None, index=None, columns=None)
![](image\20210710-2.png)

#### 瑱入陣列數值產生，設定index、columns。

In [25]:
import pandas as pd
import numpy as np

no = 10
value = np.random.randint(no * no, size = (no, no))
col = [(chr(np.random.randint(65, 90)) + chr(np.random.randint(65, 90)) + chr(np.random.randint(65, 90))) for _ in range(no)]
idx = [chr(np.random.randint(97, 122)) for _ in range(no)]
df = pd.DataFrame(value, columns = col, index = idx)
df

   RWO  QEA  JEP  CKT  QQI  WXE  QFS  AKO  JNL  BTI
p   77   38   53   55   58   98   33    2   30   96
g   94    5   90   62   69   29    6   77   15    5
u   91    8   31   97    2   29    5   85   97   64
q   83   96   62   22   83   63   15   34   55   33
m   33   75    7   66   11   83   56   58    5   52
b   29   49   96   19   51   63   81   14   39   22
j   30   98    0   27   22   61   99   10   95   38
q   39   30   98   42   44   58   77   67   15   73
m   99   29   31   27   66    6    3   95   75   74
g   91   36   12    3   25   30   84   40   56   12

#### 儲存不同數值型態。

In [26]:
import pandas as pd
import numpy as np

d = {
    "date": pd.date_range("2017-10-01", periods=7, freq = 'D'),
    "str": ["Mon.", "Tue.", "Wed.", "Thu.", "Fri.", "Sat.", "Sun."],
    "chr": list('abcdefg'),
    "int": list(range(0, 70, 10)),
    "float": np.random.random(size = 7),
    "bool": np.zeros(7, bool),
    "bool": np.random.randint(5, 15, size = 7)%2 == 0,
    "complex": [complex(np.random.randint(10), np.random.randint(10)) for _ in range(7)]
}

df = pd.DataFrame(d)
df

        date   str chr  int     float   bool   complex
0 2017-10-01  Mon.   a    0  0.327398  False  7.0+4.0j
1 2017-10-02  Tue.   b   10  0.603194   True  7.0+3.0j
2 2017-10-03  Wed.   c   20  0.104885   True  5.0+9.0j
3 2017-10-04  Thu.   d   30  0.472819   True  0.0+2.0j
4 2017-10-05  Fri.   e   40  0.466177  False  2.0+9.0j
5 2017-10-06  Sat.   f   50  0.387913  False  0.0+3.0j
6 2017-10-07  Sun.   g   60  0.078611   True  5.0+6.0j

In [34]:
import pandas as pd

d = {0:1, 2:3, 4:5}
pd.DataFrame(d, index = [0])

   0  2  4
0  1  3  5

In [36]:
import pandas as pd

d = {0:{1:2}, 3:{4:5}, 6:{7:8}}
pd.DataFrame(d)

     0    3    6
1  2.0  NaN  NaN
4  NaN  5.0  NaN
7  NaN  NaN  8.0

### 以串列 (List) 產生。

In [27]:
import pandas as pd
import numpy as np

l = list(np.random.randint(100, size =(10, 10)))
df = pd.DataFrame(l)
df

    0   1   2   3   4   5   6   7   8   9
0  40  17  67   8  64  72  91  82  20   8
1  58  99  82  19  23  44  92  90  20  12
2  33  28  62  21   5  96  69  91  58  49
3  76  37  75  58   6  81  68  89  98  87
4   9  12  23  63   6  49  60   6  29  15
5   2  33  25  65  65  11  55  43  50  70
6  15   2  80  97  53  64  23  91  30  31
7  90  80  68  52  68  17  94  52  22  88
8  56  85  10  93  61  95  82  59  40   4
9  91  97  37  63  32  24  93  94  72  43

### 以元祖(Tuple) 產生。

In [28]:
import pandas as pd
import numpy as np

t = tuple(np.random.randint(100, size = (10, 10)))
df = pd.DataFrame(t)
df

    0   1   2   3   4   5   6   7   8   9
0   4  95  63  32   6  28  64   6  30  40
1  89  97  54  24  18  32  35  22  22  62
2  98  14  28  37  57  27  27  80  76  22
3  85  29  56  21  90  79   5  24  20  46
4  60  45  49  48  71   1  52  86  83  16
5  15   9  71  29  34  58  75   6  88  48
6  99   7  66  34  52  54  97   2  41  91
7  81  21  59  30   0  72  71  47  10   0
8  79  49  82  59  60  36   6  50  96  25
9   0  97  48  35  38  27  28  32  91  86

### 以字典 (Dict) 產生。

In [37]:
import pandas as pd
import numpy as np

d = []
for i in range(5):
    d.append({'a': np.random.randint(0,  10),
              'b': np.random.randint(10, 20),
              'c': np.random.randint(20, 30)})
df = pd.DataFrame(d)
df

   a   b   c
0  3  16  22
1  2  11  20
2  2  19  27
3  5  15  29
4  7  13  28

In [ ]:
import pandas as pd
d = {'idx0':{'a':1, 'b':2, 'c':3}, 
     'idx1':{'a':4, 'b':5, 'c':6},
     'idx2':{'a':7, 'b':8, 'c':9}}
pd.DataFrame(d)

   idx0  idx1  idx2
a     1     4     7
b     2     5     8
c     3     6     9

### Series to DataFrame

In [19]:
import pandas as pd
s = pd.Series([0, 1, 2])
s = s.to_frame(name='編號')
s

   編號
0   0
1   1
2   2

### DataFrame to Series

In [20]:
s.squeeze()

0    0
1    1
2    2
Name: 編號, dtype: int64

# 2. DataFrame 增加元素
### 新增 Column

![](image\20210710-3.png)

##### 方法1

In [63]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df['地理'] = [90, 33, 45, 80, 60, 56, 69] 
df

   座號   姓名  國文  英文  數學  地理
0   1  劉德華  50  56  65  90
1   2   黎明  56  78  78  33
2   3  郭富城  78  63  96  45
3   4  張學友  96  25  65  80
4   5  張惠妹  21  98  45  60
5   6   伍百  58  25  25  56
6   7  孫燕姿  63  87  81  69

##### 方法2

In [66]:
import pandas as pd
from IPython.display import display
scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.insert(5, "歷史", [90, 70, 45, 80, 60, 33, 25]) 
display(df)

   座號   姓名  國文  英文  數學  歷史
0   1  劉德華  50  56  65  90
1   2   黎明  56  78  78  70
2   3  郭富城  78  63  96  45
3   4  張學友  96  25  65  80
4   5  張惠妹  21  98  45  60
5   6   伍百  58  25  25  33
6   7  孫燕姿  63  87  81  25

### 新增Row
![](image\20210710-4.png)

##### 方法1

In [71]:
import pandas as pd
from IPython.display import display
scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)

newdata = pd.DataFrame({'座號':[8],
                        '姓名':['蕭亞軒'],
                        '國文':[70],
                        '英文':[90],
                        '數學':[59]})
df = df.append(newdata, ignore_index=True)
display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_8576\1331775665.py:16: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(newdata, ignore_index=True)

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81
7   8  蕭亞軒  70  90  59

##### 方法2

In [79]:
import pandas as pd
from IPython.display import display
scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)

df.loc[7] = [8, '蕭亞軒', 70, 90, 59]
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81
7   8  蕭亞軒  70  90  59

# 3. 修改DataFrame 的index、columns

In [104]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

In [82]:
df.rename(columns={"國文": "自然","數學":"社會","英文":"地理"})

   座號   姓名  自然  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

In [84]:
df.columns = ["座號", "姓名", "自然","社會","地理"]
df

   座號   姓名  自然  社會  地理
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

In [ ]:
df.rename(index={0: "零", 1:'一', 2:'二', 3:'三', 4:'四', 5:'五', 6:'六'})

   座號   姓名  自然  社會  地理
零   1  劉德華  50  56  65
一   2   黎明  56  78  78
二   3  郭富城  78  63  96
三   4  張學友  96  25  65
四   5  張惠妹  21  98  45
五   6   伍百  58  25  25
六   7  孫燕姿  63  87  81

In [85]:
df.index = ["零", '一', '二', '三', '四', '五', '六']
df

   座號   姓名  自然  社會  地理
零   1  劉德華  50  56  65
一   2   黎明  56  78  78
二   3  郭富城  78  63  96
三   4  張學友  96  25  65
四   5  張惠妹  21  98  45
五   6   伍百  58  25  25
六   7  孫燕姿  63  87  81

In [91]:
df.index.name = ''
df

座號姓名科目  座號   姓名  國文  英文  數學
順位
0        1  劉德華  50  56  65
1        2   黎明  56  78  78
2        3  郭富城  78  63  96
3        4  張學友  96  25  65
4        5  張惠妹  21  98  45
5        6   伍百  58  25  25
6        7  孫燕姿  63  87  81

In [92]:
df.columns.name = '座號姓名科目'
df

座號姓名科目  座號   姓名  國文  英文  數學
順位
0        1  劉德華  50  56  65
1        2   黎明  56  78  78
2        3  郭富城  78  63  96
3        4  張學友  96  25  65
4        5  張惠妹  21  98  45
5        6   伍百  58  25  25
6        7  孫燕姿  63  87  81

In [105]:
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

In [99]:
df.to_csv('123.csv', encoding = "u`tf_8_sig", index = False)

In [100]:
df1 = pd.read_csv('123.csv', encoding = "utf_8_sig")
df1

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

In [106]:
df.to_csv('123.csv', encoding = "utf_8_sig")

In [108]:
df1 = pd.read_csv('123.csv', encoding = "utf_8_sig", index_col = ['座號'])
df1

    Unnamed: 0   姓名  國文  英文  數學
座號
1            0  劉德華  50  56  65
2            1   黎明  56  78  78
3            2  郭富城  78  63  96
4            3  張學友  96  25  65
5            4  張惠妹  21  98  45
6            5   伍百  58  25  25
7            6  孫燕姿  63  87  81

In [113]:
df1.drop(['Unnamed: 0'], axis = 1)

     姓名  國文  英文  數學
座號
1   劉德華  50  56  65
2    黎明  56  78  78
3   郭富城  78  63  96
4   張學友  96  25  65
5   張惠妹  21  98  45
6    伍百  58  25  25
7   孫燕姿  63  87  81

# 4. DataFrame 屬性、描述統計與函數計算
### DataFrame屬性：index、columns、shape、size。

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
print('df.index：', df.index)
print()
print('df.columns：', df.columns)
print()
print('df.shape：', df.shape)
print()
print('df.size：', df.size)

df.index： RangeIndex(start=0, stop=7, step=1)

df.columns： Index(['座號', '姓名', '國文', '英文', '數學'], dtype='object')

df.shape： (7, 5)

df.size： 35

#### DataFrame.info()：資訊查詢。

In [3]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   座號      7 non-null      int64
 1   姓名      7 non-null      object
 2   國文      7 non-null      int64
 3   英文      7 non-null      int64
 4   數學      7 non-null      int64
dtypes: int64(4), object(1)
memory usage: 408.0+ bytes

#### DataFrame.describe()：描述統計。

In [37]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].describe()

              國文         英文         數學
count   7.000000   7.000000   7.000000
mean   60.285714  61.714286  65.000000
std    23.343195  28.726958  23.755701
min    21.000000  25.000000  25.000000
25%    53.000000  40.500000  55.000000
50%    58.000000  63.000000  65.000000
75%    70.500000  82.500000  79.500000
max    96.000000  98.000000  96.000000

#### DataFrame.mean()：計算平均。

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].mean()

國文    60.285714
英文    61.714286
數學    65.000000
dtype: float64

#### DataFrame.median()：中位數。

In [38]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].median()

國文    58.0
英文    63.0
數學    65.0
dtype: float64

#### DataFrame.sum()：計算總和。

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].sum()

國文    422
英文    432
數學    455
dtype: int64

#### DataFrame.std()：標準差。

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].std()

國文    23.343195
英文    28.726958
數學    23.755701
dtype: float64

##### DataFrame.max()：最大值。

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].max()

國文    96
英文    98
數學    96
dtype: int64

#### DataFrame.min()：最小值。

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].min()

國文    21
英文    25
數學    25
dtype: int64

#### DataFrame.agg()：聚合函數。

In [39]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].agg(['sum', 'max', 'mean', 'median', 'std', 'min', 'count'])

                國文          英文          數學
sum     422.000000  432.000000  455.000000
max      96.000000   98.000000   96.000000
mean     60.285714   61.714286   65.000000
median   58.000000   63.000000   65.000000
std      23.343195   28.726958   23.755701
min      21.000000   25.000000   25.000000
count     7.000000    7.000000    7.000000

In [40]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.iloc[:, 2:].agg({'國文':'sum', '英文':'max', '數學':'mean'})

國文    422.0
英文     98.0
數學     65.0
dtype: float64

In [18]:
#快速判斷每一列是否有缺失值
import pandas as pd
df = pd.DataFrame({
    'V1': [1, 2, None, 4],
    'V2': [1, 2, 3, 4],
    'V3': [None, 1, 2, 3]
})

df.apply(lambda s: s.hasnans)

V1     True
V2    False
V3     True
dtype: bool

# 5. DataFrame 取值、切片
![](image\index.png)

In [46]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

## 取值
- Pandas 提供3種方式取值，分別為df.loc (名稱選值)、df.iloc (索引選值)、df.ix (名稱與索引混合選值)，df.ix 於 pandas v1.0.0以後停止使用，目前僅只有 df.loc、df.iloc。

#### df.loc[row, column]：以名稱選值。

In [43]:
df.loc[2, '姓名']

'郭富城'

#### df.iloc[row, column]：以索引選值。

In [44]:
df.iloc[2, 3]

63

## 切片
- 以Column為主，進行項目挑選。

#### 單獨挑選所有 "姓名" 欄位。
- 方法1

In [ ]:
df['姓名']

0    劉德華
1     黎明
2    郭富城
3    張學友
4    張惠妹
5     伍百
6    孫燕姿
Name: 姓名, dtype: object

- 方法2

In [ ]:
df.loc[:,'姓名']

0    劉德華
1     黎明
2    郭富城
3    張學友
4    張惠妹
5     伍百
6    孫燕姿
Name: 姓名, dtype: object

- 方法3

In [ ]:
df.iloc[:,1]

0    劉德華
1     黎明
2    郭富城
3    張學友
4    張惠妹
5     伍百
6    孫燕姿
Name: 姓名, dtype: object

##### 連續挑選 "國文"、"英文"、"數學" 欄位。
- 方法1

In [45]:
df[['國文', '英文', '數學']]

   國文  數學
0  50  65
1  56  78
2  78  96
3  96  65
4  21  45
5  58  25
6  63  81

- 方法2

In [ ]:
df.loc[:, ['國文', '英文', '數學']]

   國文  英文  數學
0  50  56  65
1  56  78  78
2  78  63  96
3  96  25  65
4  21  98  45
5  58  25  25
6  63  87  81

- 方法3

In [ ]:
df.loc[:, '國文':'數學']

   國文  英文  數學
0  50  56  65
1  56  78  78
2  78  63  96
3  96  25  65
4  21  98  45
5  58  25  25
6  63  87  81

- 方法4

In [ ]:
df.loc[:, '國文':]

   國文  英文  數學
0  50  56  65
1  56  78  78
2  78  63  96
3  96  25  65
4  21  98  45
5  58  25  25
6  63  87  81

- 方法5

In [ ]:
df.iloc[:, 2:5]

   國文  英文  數學
0  50  56  65
1  56  78  78
2  78  63  96
3  96  25  65
4  21  98  45
5  58  25  25
6  63  87  81

- 方法6

In [ ]:
df.iloc[:, 2:]

   國文  英文  數學
0  50  56  65
1  56  78  78
2  78  63  96
3  96  25  65
4  21  98  45
5  58  25  25
6  63  87  81

##### 分開挑選 "姓名"、"數學" 欄位。
- 方法1

In [ ]:
df['姓名']

0    劉德華
1     黎明
2    郭富城
3    張學友
4    張惠妹
5     伍百
6    孫燕姿
Name: 姓名, dtype: object

In [ ]:
df[['姓名', '數學']]

    姓名  數學
0  劉德華  65
1   黎明  78
2  郭富城  96
3  張學友  65
4  張惠妹  45
5   伍百  25
6  孫燕姿  81

- 方法2

In [ ]:
df.loc[:, ['姓名', '數學']]

    姓名  數學
0  劉德華  65
1   黎明  78
2  郭富城  96
3  張學友  65
4  張惠妹  45
5   伍百  25
6  孫燕姿  81

- 方法3

In [ ]:
df.iloc[:, [1, 4]]

    姓名  數學
0  劉德華  65
1   黎明  78
2  郭富城  96
3  張學友  65
4  張惠妹  45
5   伍百  25
6  孫燕姿  81

##### 以 index 為主，進行項目挑選。
###### 連續取值。

- 方法1

In [49]:
df[2:6]

   座號   姓名  國文  英文  數學
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25

- 方法2：使用df.loc連續取值範圍與 df.iloc 不同。

In [50]:
df.loc[2:5]

   座號   姓名  國文  英文  數學
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25

- 方法3：使用df.iloc連續取值範圍與 df.loc 不同。

In [51]:
df.iloc[2:6]

   座號   姓名  國文  英文  數學
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25

#### 不連續取值。

- 方法1

In [52]:
df[0::2]

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
2   3  郭富城  78  63  96
4   5  張惠妹  21  98  45
6   7  孫燕姿  63  87  81

- 方法2

In [ ]:
df.loc[0::2]

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
2   3  郭富城  78  63  96
4   5  張惠妹  21  98  45
6   7  孫燕姿  63  87  81

- 方法3

In [ ]:
df.iloc[0::2]

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
2   3  郭富城  78  63  96
4   5  張惠妹  21  98  45
6   7  孫燕姿  63  87  81

#### index 與 column 綜合應用，進行項目挑選。

- 方法1：使用df.loc連續取值範圍與 df.iloc 不同。

In [ ]:
df[['姓名', '數學']].loc[2:5]

    姓名  數學
2  郭富城  96
3  張學友  65
4  張惠妹  45
5   伍百  25

- 方法2：使用df.iloc連續取值範圍與 df.loc 不同。

In [ ]:
df[['姓名', '數學']].iloc[2:6]

    姓名  數學
2  郭富城  96
3  張學友  65
4  張惠妹  45
5   伍百  25

- 方法3：使用df.loc連續取值範圍與 df.iloc 不同。

In [ ]:
df.loc[2:5, ['姓名', '數學']]

    姓名  數學
2  郭富城  96
3  張學友  65
4  張惠妹  45
5   伍百  25

- 方法4：使用df.iloc連續取值範圍與 df.loc 不同。

In [ ]:
df.iloc[2:6, [1, -1]]

    姓名  數學
2  郭富城  96
3  張學友  65
4  張惠妹  45
5   伍百  25

# 6. 篩選

In [53]:
import pandas as pd
from IPython.display import display
scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.insert(5, "歷史", [90, 70, 45, 80, 60, 33, 25]) 
display(df)

   座號   姓名  國文  英文  數學  歷史
0   1  劉德華  50  56  65  90
1   2   黎明  56  78  78  70
2   3  郭富城  78  63  96  45
3   4  張學友  96  25  65  80
4   5  張惠妹  21  98  45  60
5   6   伍百  58  25  25  33
6   7  孫燕姿  63  87  81  25

#### 選出 "國文" 大於60以上的同學。

- 方法1

In [ ]:
df[df['國文'] > 60]

   座號   姓名  國文  英文  數學  歷史
2   3  郭富城  78  63  96  45
3   4  張學友  96  25  65  80
6   7  孫燕姿  63  87  81  25

- 方法2

In [ ]:
df[(df.loc[:, '國文'] > 60)]

   座號   姓名  國文  英文  數學  歷史
2   3  郭富城  78  63  96  45
3   4  張學友  96  25  65  80
6   7  孫燕姿  63  87  81  25

- 方法3

In [ ]:
df.loc[(df.loc[:, '國文'] > 60)]

   座號   姓名  國文  英文  數學  歷史
2   3  郭富城  78  63  96  45
3   4  張學友  96  25  65  80
6   7  孫燕姿  63  87  81  25

#### 選出 "國文" 與 "英文" 大於60以上的同學。

- 方法1

In [59]:
df[(df['國文'] > 60) & (df['英文'] > 60)]

   座號   姓名  國文  英文  數學  歷史
2   3  郭富城  78  63  96  45
6   7  孫燕姿  63  87  81  25

- 方法2

In [ ]:
df[(df.loc[:, '國文'] > 60) & (df.loc[:, '英文'] > 60)]

   座號   姓名  國文  英文  數學  歷史
2   3  郭富城  78  63  96  45
6   7  孫燕姿  63  87  81  25

- 方法3

In [ ]:
df.loc[(df.loc[:, '國文'] > 60) & (df.loc[:, '英文'] > 60)]

   座號   姓名  國文  英文  數學  歷史
2   3  郭富城  78  63  96  45
6   7  孫燕姿  63  87  81  25

- 方法4

In [ ]:
df[(df.iloc[:, 2] > 60) & (df.iloc[:, 3] > 60)]

   座號   姓名  國文  英文  數學  歷史
2   3  郭富城  78  63  96  45
6   7  孫燕姿  63  87  81  25

#### 選出 "國文" 大於 60 同學的"歷史" 成績。

- 方法1

In [ ]:
df.loc[df['國文'] > 60, ["姓名", "歷史"]]

    姓名  歷史
2  郭富城  45
3  張學友  80
6  孫燕姿  25

- 方法2

In [60]:
df.loc[df.iloc[:, 2] > 60, ["姓名", "歷史"]]

    姓名  歷史
2  郭富城  45
3  張學友  80
6  孫燕姿  25

#### 以 df.max、df.idxmax 取出 "英文" 成績最高的學生名。

#### df.max

In [ ]:
df['英文'].max()

98

#### df.idxmax 
- 方法1

In [63]:
df['姓名'][df['英文'].idxmax()]

'張惠妹'

- 方法2

In [ ]:
df.loc[df['英文'].idxmax(), '姓名']

'張惠妹'

- 方法3

In [ ]:
df.loc[df['英文'].idxmax()]['姓名']

'張惠妹'

- 方法4

In [ ]:
df.iloc[df['英文'].idxmax(), 1]

'張惠妹'

- 方法5

In [ ]:
df.iloc[df['英文'].idxmax()][1]

'張惠妹'

#### 以 df.min、df.idxmin 取出 "數學" 成績最低的學生名。

#### df.min

In [ ]:
df['數學'].min()

25

#### df.idxmin
- 方法1

In [66]:
df['姓名'][df['數學'].idxmin()]

'伍百'

- 方法2

In [ ]:
df.loc[df['數學'].idxmin(), '姓名']

'伍百'

- 方法3

In [ ]:
df.loc[df['數學'].idxmin()]['姓名']

'伍百'

- 方法4

In [ ]:
df.iloc[df['數學'].idxmin(), 1]

'伍百'

- 方法5

In [ ]:
df.iloc[df['數學'].idxmin()][1]

'伍百'

#### 取出 "國文" 成績最高與 "歷史" 成績最低的學生。

- 方法1

In [ ]:
df.loc[[df['國文'].idxmax()]+[df['歷史'].idxmin()]]

   座號   姓名  國文  英文  數學  歷史
3   4  張學友  96  25  65  80
6   7  孫燕姿  63  87  81  25

- 方法2

In [ ]:
df.loc[[df['國文'].idxmax(), df['歷史'].idxmin()]]

   座號   姓名  國文  英文  數學  歷史
3   4  張學友  96  25  65  80
6   7  孫燕姿  63  87  81  25

- 方法3

In [ ]:
df.iloc[[df['國文'].idxmax()]+[df['歷史'].idxmin()]]

   座號   姓名  國文  英文  數學  歷史
3   4  張學友  96  25  65  80
6   7  孫燕姿  63  87  81  25

- 方法4

In [ ]:
df.iloc[[df['國文'].idxmax(), df['歷史'].idxmin()]]

   座號   姓名  國文  英文  數學  歷史
3   4  張學友  96  25  65  80
6   7  孫燕姿  63  87  81  25

# 7. 排名

In [75]:
import pandas as pd
from IPython.display import display
scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.insert(5, "歷史", [90, 70, 45, 80, 60, 33, 25]) 
df[['總分', '平均']] = df.apply(lambda x:x[2:].agg(['sum', 'mean']), axis = 1)
df['總排名_average'] = df['總分'].rank(method='average', ascending=False) #average策略下，相同數值的元素的排名是其內部排名的均值
df['總排名_min'] = df['總分'].rank(method='min', ascending=False) #min策略下，相同元素的排名為其內部排名的最小值
df['總排名_max'] = df['總分'].rank(method='max', ascending=False) #max策略與min正好相反，取的是相同元素內部排名的最大值
df['總排名_first'] = df['總分'].rank(method='first', ascending=False) #在first策略下，當多個元素相同時，會根據這些相同元素在實際Series中的順序分配排名
df['總排名_dense'] = df['總分'].rank(method='dense', ascending=False) #在dense策略下，相當於對序列去重後進行排名，再將每個元素的排名賦給相同的每個元素，這種方式也是比較貼合實際需求的
#df.sort_values('總排名_average')
df

,座號,姓名,國文,英文,數學,歷史,總分,平均,總排名_average,總排名_min,總排名_max,總排名_first,總排名_dense
0,1,劉德華,50,56,65,90,261.0,65.25,4.0,4.0,4.0,4.0,3.0
1,2,黎明,56,78,78,70,282.0,70.50,1.5,1.0,2.0,1.0,1.0
2,3,郭富城,78,63,96,45,282.0,70.50,1.5,1.0,2.0,2.0,1.0
3,4,張學友,96,25,65,80,266.0,66.50,3.0,3.0,3.0,3.0,2.0
4,5,張惠妹,21,98,45,60,224.0,56.00,6.0,6.0,6.0,6.0,5.0
5,6,伍百,58,25,25,33,141.0,35.25,7.0,7.0,7.0,7.0,6.0
6,7,孫燕姿,63,87,81,25,256.0,64.00,5.0,5.0,5.0,5.0,4.0

### 條件設定 [style](https://pandas.pydata.org/docs/reference/style.html)：highlight_max, highlight_min, highlight_null 

##### highlight_max(subset=None, color='yellow', axis=0)
##### highlight_min(subset=None, color='yellow', axis=0)
- subset：指定範圍
- color：指定顏色
- axis：指定行列，axis = 0 -> column, axis = 1 -> row

##### highlight_null(null_color='red', subset=None)
- subset：指定範圍
- null_color：指定顏色

In [76]:
df.style.highlight_max(subset=['國文', '英文', '數學', '歷史'], color = 'red').highlight_min(subset=['國文', '英文', '數學', '歷史'], color = 'green')

In [81]:
format_dict = {'總分':'{:.0f}', '平均': '{:.2f}'}
df.style.format(format_dict).bar(subset=['總分', '平均'], color='#80c8ff', align='zero')

# 8. 各科成績分布
#### pandas.cut(x, bins, right=True, labels=None)

用途：回傳 x 中的每一個數據在bins 中對應的範圍

參數：
- x ：必須是一維資料來源。
- bins：整數、序列或間隔索引。
- labels：對應bins區間的文字列表。
- 語法：https://pandas.pydata.org/docs/reference/api/pandas.cut.html?highlight=pandas%20cut#pandas.cut

In [1]:
import pandas as pd
from IPython.display import display
scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]
}
df = pd.DataFrame(scores)
df.insert(5, "歷史", [90, 70, 45, 80, 60, 33, 25]) 
df[['總分', '平均']] = df.apply(lambda x:x[2:].agg(['sum', 'mean']), axis = 1)
df

   座號   姓名  國文  英文  數學  歷史     總分     平均
0   1  劉德華  50  56  65  90  261.0  65.25
1   2   黎明  56  78  78  70  282.0  70.50
2   3  郭富城  78  63  96  45  282.0  70.50
3   4  張學友  96  25  65  80  266.0  66.50
4   5  張惠妹  21  98  45  60  224.0  56.00
5   6   伍百  58  25  25  33  141.0  35.25
6   7  孫燕姿  63  87  81  25  256.0  64.00

In [2]:
bins = [0, 59, 70, 80, 90, 100]
stauts = ["再努力", "不錯", "很好", "很棒", "很棒棒"]
df.insert(6, "歷史成績評語", pd.cut(df['歷史'].tolist(), bins, labels = stauts))
df.insert(5, "數學成績評語", pd.cut(df['數學'].tolist(), bins, labels = stauts))
df.insert(4, "英文成績評語", pd.cut(df['英文'].tolist(), bins, labels = stauts))
df.insert(3, "國文成績評語", pd.cut(df['國文'].tolist(), bins, labels = stauts))
df

   座號   姓名  國文 國文成績評語  英文 英文成績評語  數學 數學成績評語  歷史 歷史成績評語     總分     平均
0   1  劉德華  50    再努力  56    再努力  65     不錯  90     很棒  261.0  65.25
1   2   黎明  56    再努力  78     很好  78     很好  70     不錯  282.0  70.50
2   3  郭富城  78     很好  63     不錯  96    很棒棒  45    再努力  282.0  70.50
3   4  張學友  96    很棒棒  25    再努力  65     不錯  80     很好  266.0  66.50
4   5  張惠妹  21    再努力  98    很棒棒  45    再努力  60     不錯  224.0  56.00
5   6   伍百  58    再努力  25    再努力  25    再努力  33    再努力  141.0  35.25
6   7  孫燕姿  63     不錯  87     很棒  81     很棒  25    再努力  256.0  64.00

In [3]:
國文 = pd.value_counts(pd.cut(df['國文'], bins), sort=False)
英文 = pd.value_counts(pd.cut(df['英文'], bins), sort=False)
數學 = pd.value_counts(pd.cut(df['數學'], bins), sort=False)
歷史 = pd.value_counts(pd.cut(df['歷史'], bins), sort=False)

各科分數分級統計 = pd.DataFrame({'國文':國文, '英文':英文, '數學':數學, '歷史':歷史}, index = 國文.index)
各科分數分級統計

           國文  英文  數學  歷史
(0, 59]     4   3   2   3
(59, 70]    1   1   2   2
(70, 80]    1   1   1   1
(80, 90]    0   1   1   1
(90, 100]   1   1   1   0

# 9. 資料存取(CSV、Excel、SQLite)

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]          
}
df = pd.DataFrame(scores)
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

## 9-1 儲存與讀取 CSV

In [ ]:
df.to_csv('scores.csv')

![](image\20210710-5.png)
- 注意：直接存檔至 CSV，多出一個Column內容，這不是我們要的，那是 pandas 自動將 index 的部份一起存入 CSV，若不希望 index 一起被存入CSV檔案，可添加 index = 0 屬性。

In [ ]:
df.to_csv('scores.csv', index = 0)

![](image\20210710-6.png)

- Python3 預設編碼為 UTF-8，不指定編碼儲直接存成CSV檔，再以 Excel 開啟該 CSV 檔，將會遇到中文亂碼，這是由於 Windows 的 Excel 不支援 "UTF-8" 所導致。

![](image\20210710-7.png)

- 要解決上述問題，改變輸出編碼為 BIG-5，添加 encoding = 'big5'。

In [ ]:
df.to_csv('scores.csv', encoding = 'big5', index = 0)

#### 讀取CSV

In [ ]:
df = pd.read_csv('scores.csv', encoding = 'big5')
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

# 9-2 儲存與讀取 Excel
### 以 df.to_excel() 無指定活頁簿名稱，資料儲存在預設 "Sheet1" 活頁簿中。

In [ ]:
df.to_excel('scores.xlsx', index = 0)

![](image\20210710-8.png)

- df.to_excel() 參數如下。

![](image\20210710-9.png)

#### 若無指定活頁簿名稱存檔，則 pd.read_excel()  讀取Excel檔案，將無需指定活頁簿名稱。

In [ ]:
df = pd.read_excel('scores.xlsx')
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

#### 以 df.to_excel() 指定活頁簿名稱，資料儲存在指定名稱的活頁簿中。

In [ ]:
df.to_excel('scores.xlsx', sheet_name = "學生成績", index = 0)

![](image\20210710-10.png)

#### 若指定活頁簿名稱 "學生成績" 存檔，則 pd.read_excel()  讀取Excel檔案，需指定活頁簿名稱 "學生成績"，才能讀取資料內容。

In [ ]:
df = pd.read_excel('scores.xlsx', sheet_name = "學生成績")
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

# 9-3 儲存與讀取 SQLite
#### 透過 sqlite3 套件，將學生成績寫入 "student_scores.sqlite"，透過[ DB Browser for SQLite](https://sqlitebrowser.org/) 進行查看1

In [ ]:
import sqlite3 as lite

with lite.connect("student_scores.sqlite") as db:
    df.to_sql(name ='student', con = db, if_exists='replace')

#### 查看 "student_scores.sqlite" 內  "student" 資料表內容。
![](image\20210710-11.png)
#### 讀取 "student_scores.sqlite" 內  "student" 資料表內容。

In [ ]:
import sqlite3 as lite
with lite.connect('student_scores.sqlite') as db:
    df = pd.read_sql_query('SELECT * FROM student;', db, index_col = ['index'])
df.head()

       座號   姓名  國文  英文  數學
index
0       1  劉德華  50  56  65
1       2   黎明  56  78  78
2       3  郭富城  78  63  96
3       4  張學友  96  25  65
4       5  張惠妹  21  98  45

## 9-4 資料型別改變

In [1]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]          
}
df = pd.DataFrame(scores)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   座號      7 non-null      int64
 1   姓名      7 non-null      object
 2   國文      7 non-null      int64
 3   英文      7 non-null      int64
 4   數學      7 non-null      int64
dtypes: int64(4), object(1)
memory usage: 408.0+ bytes

In [2]:
df.memory_usage(), df.memory_usage(deep=True)

(Index    128
 座號        56
 姓名        56
 國文        56
 英文        56
 數學        56
 dtype: int64,
 Index    128
 座號        56
 姓名       612
 國文        56
 英文        56
 數學        56
 dtype: int64)

In [3]:
df.memory_usage().sum() , df.memory_usage(deep=True).sum()

(408, 964)

### Python資料型別的範圍
|資料型別|範圍|
|-|-|
|uint8|0 to 255|
|uint16|0 to 65535|
|uint32|0 to 232|
|float|-1 to 1 or 0 to 1|
|int8|-128 to 127|
|int16|-32768 to 32767|
|int32|-231 to 231 - 1|

In [ ]:
df['國文'] = df['國文'].astype('int8')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   座號      7 non-null      int8
 1   姓名      7 non-null      object
 2   國文      7 non-null      int8
 3   英文      7 non-null      int64
 4   數學      7 non-null      int64
dtypes: int64(2), int8(2), object(1)
memory usage: 310.0+ bytes

In [15]:
df.astype({'座號':'int8', 
           '國文':'int8',
           '英文':'int8',
           '數學':'int8'}).memory_usage(deep=True).sum()

768

In [16]:
df.astype('category').memory_usage(deep=True).sum()

2291

### Numpy資料型別的範圍
|資料型別|類型代碼|範圍|
|-|-|-|
|bool_|?|一個位元組的布林值（真或假）|
|string_|S|'S10'表示生成一個長度爲10個位元組串型別|
|object|O|Python object型別|
|unicode_或str|U|'U10'生成一個長度爲10的unicode字串型別|
|inti|-|整數，大小由平臺決定|
|int8|i1|整數，大小為一個位元組，範圍：-128 ~ 127 = -2^7 ~ 2^7-1|
|int16|i2|整數，大小為二個位元組，範圍：-32768 ~ 32767 = -2^15 ~ 2^15-1 |
|int32|i4|整數，大小為四個位元組，範圍：-2147483648 ~ 2147483647 = -2^31 ~ 2^31-1 |
|int64|i8|整數，大小為八個位元組，範圍：-9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807 = -2^63 ~ 2^36-1 |
|uint8|u1|不帶正負號的整數，大小為一個位元組，範圍：0 ~ 255|
|uint16|u2|不帶正負號的整數，大小為二個位元組，範圍：0 ~ 2^16-1(65535)|
|uint32|u4|不帶正負號的整數，大小為四個位元組，範圍：0 ~ 2^32-1|
|uint64|u8|不帶正負號的整數，大小為八個位元組，範圍：0 ~ 2^64-1|
|float16|f2|半精度浮點數：大小為二個位元組，16位bit，正負號1位，指數5位，精度10位|
|float32|f4或f|單精確度浮點數：大小為四個位元組，32位bit，正負號1位，指數8位，精度32位|
|float64 / float|f8或d|雙精度浮點數：大小為八個位元組，64位bit，正負號1位，指數11位，精度52位|
|float128|f16或g|擴展精準度|
|complex64|c8|複數，分別用於兩個32位bit浮點數表示實部和虛部|
|complex128 / complex|c16|複數，分別用兩個64位bit浮點數表示實部和虛部|
|complex256 / complex|c32|複數，分別用兩個128位bit浮點數表示實部和虛部|

In [4]:
import numpy as np
df = pd.read_csv('scores.csv', encoding = 'big5', dtype= {'座號':np.int8})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  7 non-null      int64
 1   座號          7 non-null      int8
 2   姓名          7 non-null      object
 3   國文          7 non-null      int64
 4   英文          7 non-null      int64
 5   數學          7 non-null      int64
dtypes: int64(4), int8(1), object(1)
memory usage: 415.0+ bytes

# 9-5 字串轉數值

In [ ]:
import pandas as pd

scores = {'座號':[1, 2, 3 ,4, 5, 6, 7],
          '姓名':['劉德華', '黎明', '郭富城', '張學友', '張惠妹', '伍百', '孫燕姿'],
          '國文':[50, 56, 78, 96, 21, 58, 63],
          '英文':[56, 78, 63, 25, 98, 25, 87],
          '數學':[65, 78, 96, 65, 45, 25, 81]          
}
df = pd.DataFrame(scores, dtype = object)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   座號      7 non-null      object
 1   姓名      7 non-null      object
 2   國文      7 non-null      object
 3   英文      7 non-null      object
 4   數學      7 non-null      object
dtypes: object(5)
memory usage: 408.0+ bytes

In [ ]:
df['座號'] = df['座號'].apply(lambda x:int(x))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   座號      7 non-null      int64
 1   姓名      7 non-null      object
 2   國文      7 non-null      object
 3   英文      7 non-null      object
 4   數學      7 non-null      object
dtypes: int64(1), object(4)
memory usage: 408.0+ bytes

In [ ]:
df['座號'] = df['座號'].astype('int8')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   座號      7 non-null      int8
 1   姓名      7 non-null      object
 2   國文      7 non-null      object
 3   英文      7 non-null      object
 4   數學      7 non-null      object
dtypes: int8(1), object(4)
memory usage: 359.0+ bytes

####  pandas.to_numeric(arg, errors='raise', downcast=None)
* **arg** ： scalar(標量)，list(列表)，
    * (tuple)元組，一維陣列(1-d array)或Series

* **errors**：三種取值，'ignore', 'raise', 'coerce'，預設為raise。
    * 'raise'，則無效的解析將引發異常
    * 'coerce'，那麼無效解析將被設置為NaT
    * 'ignore'，那麼無效的解析將回傳輸入值
* **downcast** ： {'integer'，'signed'，'unsigned'，'float'}，
    * 預設為None，如果不是None（無），並且資料已成功轉換為數位dtype（或者資料是從數位開始的），則根據以下規則將結果資料轉換為可能的最小數位dtype：
       * integer 或 signed：最小的有符號int dtype（最小值：np.int8）
       * unsigned：最小的無符號int dtype（最小值：np.uint8）
       * float：最小的float dtype（最小值：np.float32）

In [ ]:
df['座號'] = pd.to_numeric(df['座號'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   座號      7 non-null      int64
 1   姓名      7 non-null      object
 2   國文      7 non-null      object
 3   英文      7 non-null      object
 4   數學      7 non-null      object
dtypes: int64(1), object(4)
memory usage: 408.0+ bytes

In [ ]:
df = df.apply(pd.to_numeric, errors = 'ignore')
df

   座號   姓名  國文  英文  數學
0   1  劉德華  50  56  65
1   2   黎明  56  78  78
2   3  郭富城  78  63  96
3   4  張學友  96  25  65
4   5  張惠妹  21  98  45
5   6   伍百  58  25  25
6   7  孫燕姿  63  87  81

# 10. 合併 concat
# 10-1 DataFrame垂直合併
- 不同索引

In [10]:
import numpy as np
import pandas as pd

l = []
for _ in range(10):
    a = np.random.randint(1000,size = (5,6))
    l.append(pd.DataFrame(a))
df = pd.concat(l,ignore_index = True)
df #concat可以水平、垂直合併，merge只能水平合併

      0    1    2    3    4    5
0   890  549  195  591  657  257
1   254  682  843  135  660  711
2   937  593  154  832  667  949
3   446   65  777  886  996  490
4   450  165  665  807   91   46
5   516  564  784  584  441  522
6   408  834  581  329  762  931
7    96   60  436  247  941  125
8   433  816  197  693  998  636
9   976  857  214  288  220  707
10  965  169  863  482  525   67
11  175  772  337  197  641  670
12  781  888  118   91   82  791
13  855  255  944  624  107  504
14  482  277   65  215  406  403
15  638   28    7  799  199  343
16  378  916  582  532  344  405
17  311  186  682  739  262  207
18  326  711   27  163  376  564
19  438  857  278  104   54  520
20  948  621  748  720   70  304
21  111  728  804  629   31  445
22  844  656  360  369  785   58
23  407  216  487  742  355  997
24  790  955  894  182  172    2
25  157  452  891  886  398  268
26  374  927  952  901  239  979
27  587  505  298  559  874  480
28  384  953  240  594  212  259
29  465  179  608  516  903  897
30  855  429  472  306  693  931
31  288  234  147  773  991  661
32  276  226  690  485  286  121
33  198  259  457  586  848  640
34  703  421   72   96  959  140
35  218  619  384  808  875  429
36  803  900  486  164  658  297
37  347  504   91  176  768  725
38  356   57  898  855  795  436
39  766  722  198  270  487  127
40  982  694  683  279  278  147
41  693   75  438  178  138  636
42  697  551  103  494   32  959
43   51  888   42  211  161  839
44  779  791  308  610    9  458
45  639  651  819  953   98  788
46  564  230  881  928  344  397
47  998  617  421  237  193  378
48  131   44  781  856  761   36
49  560  165   54  673   77  607

In [ ]:
#DataFrame
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(5, size = (5, 5)), index = range(0, 5))
df2 = pd.DataFrame(np.random.randint(5, size = (5, 5)), index = range(5, 10))
df = pd.concat([df1, df2]) #concat可以兩個以上合併
df

   0  1  2  3  4
0  2  4  3  3  4
1  4  4  2  2  4
2  4  2  2  4  4
3  3  4  2  2  1
4  2  1  4  4  4
5  4  2  1  0  3
6  1  3  2  2  2
7  3  3  3  0  3
8  2  0  1  2  1
9  1  2  0  0  0

- 相同索引

In [ ]:
#DataFrame
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(5, size = (5, 5)), index = np.random.randint(5, size = 5))
df2 = pd.DataFrame(np.random.randint(5, size = (5, 5)), index = np.random.randint(5, size = 5))
df = pd.concat([df1, df2], ignore_index = True)
df #concat預設是垂直合併axis = 0

   0  1  2  3  4
0  0  2  3  3  2
1  0  4  0  4  2
2  1  4  1  2  3
3  0  1  0  0  0
4  1  4  1  1  4
5  1  1  3  4  2
6  4  1  1  4  0
7  2  2  1  3  0

# 10-2 DataFrame水平合併
- 不同索引

In [ ]:
#DataFrame
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(1, 10, (5, 5)), index = range(0, 5))
df2 = pd.DataFrame(np.random.randint(1, 10, (5, 5)), index = range(5, 10))
df = pd.concat([df1, df2], axis = 1)
df

     0    1    2    3    4    0    1    2    3    4
0  2.0  5.0  5.0  4.0  6.0  NaN  NaN  NaN  NaN  NaN
1  4.0  1.0  5.0  2.0  5.0  NaN  NaN  NaN  NaN  NaN
2  9.0  9.0  3.0  4.0  5.0  NaN  NaN  NaN  NaN  NaN
3  1.0  8.0  9.0  9.0  8.0  NaN  NaN  NaN  NaN  NaN
4  4.0  2.0  5.0  3.0  4.0  NaN  NaN  NaN  NaN  NaN
5  NaN  NaN  NaN  NaN  NaN  1.0  9.0  7.0  9.0  6.0
6  NaN  NaN  NaN  NaN  NaN  5.0  6.0  9.0  6.0  2.0
7  NaN  NaN  NaN  NaN  NaN  1.0  2.0  6.0  2.0  9.0
8  NaN  NaN  NaN  NaN  NaN  5.0  1.0  3.0  7.0  8.0
9  NaN  NaN  NaN  NaN  NaN  5.0  4.0  6.0  1.0  6.0

- 相同索引

In [ ]:
#DataFrame
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(1, 10, (5, 5)), index = range(0, 5))
df2 = pd.DataFrame(np.random.randint(1, 10, (5, 5)), index = range(0, 5))

df = pd.concat([df1, df2], axis = 1, ignore_index = True)
df

   0  1  2  3  4  5  6  7  8  9
0  7  4  8  9  3  9  2  3  4  3
1  3  8  7  9  4  8  7  1  6  7
2  2  1  9  8  4  6  8  1  8  4
3  8  4  2  4  7  2  7  8  9  4
4  4  8  4  3  6  8  8  2  5  3

### 易忽略的錯誤 ValueError: Plan shapes are not aligned

In [13]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame(np.ones((4, 4))*1, columns=list('DCBA'), index=list('4321'))
df2 = pd.DataFrame(np.ones((4, 4))*2, columns=list('FEDC'), index=list('6543'))
df3 = pd.DataFrame(np.ones((4, 4))*3, columns=list('FEBA'), index=list('6521'))

df2.index = list('4322')
df = pd.concat([df1, df2],axis = 1)
df                                           #水平合併

InvalidIndexError: Reindexing only valid with uniquely valued Index objects

In [11]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame(np.ones((4, 4))*1, columns=list('DCBA'), index=list('4321'))
df2 = pd.DataFrame(np.ones((4, 4))*2, columns=list('FEDC'), index=list('6543'))
df3 = pd.DataFrame(np.ones((4, 4))*3, columns=list('FEBA'), index=list('6521'))

df1.columns = list('DDBA')
df = pd.concat([df1, df2])
df #conlumns & index重疊，會沒辦法合併                       #垂直合併

InvalidIndexError: Reindexing only valid with uniquely valued Index objects

### 解決方式：判別重覆columns

In [ ]:
df1.columns.duplicated()

array([False,  True, False, False])

In [ ]:
df1.columns.drop_duplicated()#刪除類別資料

In [ ]:
df1

     D    D    B    A
4  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0

# 11. 合併merge

In [ ]:
import numpy as np
import pandas as pd

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

print('left', '\n', left)
print()
print('right', '\n', right)

left
   key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

right
   key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

# 11-1 merge 合併方法中，on的使用

In [ ]:
res = pd.merge(left, right, on='key')
print(res)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [14]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                      'key2': ['K0', 'K1', 'K0', 'K1'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                       'key2': ['K0', 'K0', 'K0', 'K0'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})

print('left', '\n', left)
print()
print('right', '\n', right)

left
   key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

right
   key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

# 11-2 merge 合併方法中，how的使用
+ left:以左邊為主
+ right：以右邊為主
+ outer：不管key
+ inner：以相同key為主，配合on

In [ ]:
res = pd.merge(left, right, on=['key1', 'key2'], how='inner')
print(res)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
res = pd.merge(left, right, on=['key1', 'key2'], how='outer')
print(res)

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [ ]:
res = pd.merge(left, right, on=['key1', 'key2'], how='left')
print(res)

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [ ]:
res = pd.merge(left, right, on=['key1', 'key2'], how='right')
print(res)

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [15]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

print('left', '\n', left)
print()
print('right', '\n', right)

left
      A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

right
      C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
res = pd.merge(left, right, left_index=True, right_index=True, how='outer')
print(res)

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
res = pd.merge(left, right, left_index=True, right_index=True, how='inner')
print(res)

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [17]:
df1 = pd.DataFrame({'col1':[0,1], 'col_left':['a','b']})
df2 = pd.DataFrame({'col1':[1,2,2],'col_right':[2,2,2]})

print(df1)

   col1 col_left
0     0        a
1     1        b

In [18]:
print(df2)

   col1  col_right
0     1          2
1     2          2
2     2          2

In [19]:
res = pd.merge(df1, df2, on='col1', how='outer', indicator=True)
print(res)

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

In [ ]:
res = pd.merge(df1, df2, on='col1', how='outer', indicator='indicator_column')
print(res)

   col1 col_left  col_right indicator_column
0     0        a        NaN        left_only
1     1        b        2.0             both
2     2      NaN        2.0       right_only
3     2      NaN        2.0       right_only

# 12.分組 groupby
## 使用方法
* groupby(欄位).agg([函數1, 函數2, 函數3, ...])
* groupby(欄位).agg({欄位:函數})
* groupby(欄位).agg(新欄位1=(欄位:函數), 新欄位2=(欄位:函數), ....)
* groupby([欄位1, 欄位2, ...]).agg({欄位:函數})

In [20]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
      '產品': ['蘋果','奇異果','檸檬','牛排','肥牛','豬腩肉','雞翅膀','奶酪','牛奶'],
      '種類': ['水果','水果','水果','肉類','肉類','肉類','肉類','奶製品','奶製品'],
      '保存方式': ['新鮮','新鮮','新鮮','新鮮','冷藏','冷藏','新鮮','冷藏','新鮮'],
      '原產地': ['本地','進口','本地','本地','進口','進口','本地','本地','本地'],
      '位址': ['貨區 A1','貨區 A3','貨區 A1','貨區 A2','貨區 B2','貨區 B1','貨區 A4','貨區 B2','貨區 A1'],
      '原價': [3.6, 6.3, 2.4, 10.3, 16.6, 8.5, 6.6, 5.3, 2.4],
      '優惠價': [3.4, 5.7, 1.9, 10.2, 13.9, 7.9, 5.2, 5.1, 1.9],
      '貨存': [67, 70, 80, 98, 91, 40, 70, 86, 72],
    }    
)
df

    產品   種類 保存方式 原產地     位址    原價   優惠價  貨存
0   蘋果   水果   新鮮  本地  貨區 A1   3.6   3.4  67
1  奇異果   水果   新鮮  進口  貨區 A3   6.3   5.7  70
2   檸檬   水果   新鮮  本地  貨區 A1   2.4   1.9  80
3   牛排   肉類   新鮮  本地  貨區 A2  10.3  10.2  98
4   肥牛   肉類   冷藏  進口  貨區 B2  16.6  13.9  91
5  豬腩肉   肉類   冷藏  進口  貨區 B1   8.5   7.9  40
6  雞翅膀   肉類   新鮮  本地  貨區 A4   6.6   5.2  70
7   奶酪  奶製品   冷藏  本地  貨區 B2   5.3   5.1  86
8   牛奶  奶製品   新鮮  本地  貨區 A1   2.4   1.9  72

In [21]:
def highlight(x):
    c1 = 'background-color: #92D050'
    c2 = 'background-color: #00B0F0'    
    c3 = 'background-color: #FF0000'
    
    df1 = pd.DataFrame('', index=x.index, columns=x.columns)
    df1.loc[[0, 1, 2], :] = c1
    df1.loc[3:6] = c2
    df1.loc[7:] = c3
    return df1

df.style.apply(highlight, axis=None)

In [23]:
# 查看每個分組內有多少項目
kind = df.groupby('種類')
kind.size()

種類
奶製品    2
水果     3
肉類     4
dtype: int64

In [24]:
# 查看每個分組內的項目
kind.get_group('水果')

    產品  種類 保存方式 原產地     位址   原價  優惠價  貨存
0   蘋果  水果   新鮮  本地  貨區 A1  3.6  3.4  67
1  奇異果  水果   新鮮  進口  貨區 A3  6.3  5.7  70
2   檸檬  水果   新鮮  本地  貨區 A1  2.4  1.9  80

In [ ]:
# 查看被分成那些組
kind.groups

{'奶製品': [7, 8], '水果': [0, 1, 2], '肉類': [3, 4, 5, 6]}

In [27]:
#join裡面帶序列
import pandas as pd
import numpy as np
print('='.join(['1','2','3','4','5']))
print('='.join(tuple(['1','2','3','4','5'])))
print('='.join(set(['1','2','3','4','5'])))
print('='.join(np.array(['1','2','3','4','5'])))
print('='.join(pd.Series(['1','2','3','4','5'])))
print('='.join(dict({'1':'2','3':'4','5':'6'})))
print('='.join(dict({'1':'2','3':'4','5':'6'}).values()))

1=2=3=4=5
1=2=3=4=5
4=5=3=2=1
1=2=3=4=5
1=2=3=4=5
1=3=5
2=4=6

In [ ]:
# 將文字組合成一行
df.groupby('種類').agg({'產品': ','.join})

                產品
種類
奶製品          奶酪,牛奶
水果       蘋果,奇異果,檸檬
肉類   牛排,肥牛,豬腩肉,雞翅膀

In [ ]:
# 尋找每個組別的數量
df.groupby('種類').agg({'產品':len})

     產品
種類
奶製品   2
水果    3
肉類    4

In [ ]:
#將數字加起上來/尋找平均值
df.groupby('種類').agg({'貨存':sum})

      貨存
種類
奶製品  158
水果   217
肉類   299

In [ ]:
# 多層的分組（multi-level）
df.groupby(['種類','保存方式']).agg({'貨存':sum}) 
             #多欄位用中括弧

           貨存
種類  保存方式
奶製品 冷藏     86
    新鮮     72
水果  新鮮    217
肉類  冷藏    131
    新鮮    168

In [28]:
import numpy as np
# 重複使用同一個列（column）
df.groupby(['種類']).agg(
    平均的原價=('原價', np.mean),
    最高的原價=('原價', max),
    最低的原價=('原價', min),
    總貨存=('貨存', sum),
    )

     平均的原價  最高的原價  最低的原價  總貨存
種類
奶製品   3.85    5.3    2.4  158
水果    4.10    6.3    2.4  217
肉類   10.50   16.6    6.6  299

# 13.樞紐分析表
df.pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)
<br/>或<br/>
pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False)

#### 常用參數：
* data : 讀取要使用的 DataFrame 
* index : 必要參數。此處輸入不想要變動的數據，作為想要比較的欄位基礎，該數據會成為第一欄的索引（index），此處能以 list、array 等方式輸入多個 index，則結果會以巢狀的方式呈現。
* values : 可選。可以對需要計算的數據做篩選，如果以 list、array 等方式輸入多個 value，則能夠分別獲得該欄位的不同數值。
* columns : 可選。用以分割數據，去選出想比較的特定欄位。
* aggfunc : function 參數。Pivot Table 能夠引入 count、diff、mean、max、min 等內建參數，甚至能自訂 function 使用。
* margins : 小計功能。
* fill_value : 缺值填滿。
![](image/20221102-1.png)

In [30]:
import pandas as pd

df = pd.read_csv('90年業務部門業績與毛利.csv', encoding = 'big5')
df

     部門名稱 主管姓名   姓名        年薪         業績         毛利       業績目標90
0    業務四課  林鵬翔  毛渝南  939360.0  4180970.0  1798000.0   89100000.0
1    業務三課  朱金倉  張志輝  389340.0  1618440.0   696000.0  100000000.0
2    業務二課  陳雅賢  向大鵬  289224.0  6069150.0  2610000.0   74930000.0
3    業務四課  林鵬翔  李進祿  309000.0  1753310.0   754000.0   89100000.0
4    業務四課  林鵬翔  林鵬翔  444960.0  9710640.0  4176000.0   89100000.0
..    ...  ...  ...       ...        ...        ...          ...
110  業務四課  林鵬翔  林鵬翔  444960.0  1246400.0   536800.0   89100000.0
111  業務四課  林鵬翔  林鵬翔  444960.0  2648600.0  1140700.0   89100000.0
112  業務四課  林鵬翔  李進祿  309000.0  1963080.0   845460.0   89100000.0
113  業務三課  朱金倉  朱金倉  480804.0   981540.0   422730.0  100000000.0
114  業務一課  陳曉蘭  陳曉蘭  364620.0  1651480.0   711260.0   86920000.0

[115 rows x 7 columns]

In [31]:
#Pandas Pivot Table建立方式
pvt = df.pivot_table(values='業績目標90', index='部門名稱')
pvt

           業績目標90
部門名稱
業務一課   86920000.0
業務三課  100000000.0
業務二課   74930000.0
業務四課   89100000.0

In [29]:
#Pandas Pivot Table自訂統計方法
import pandas as pd
import numpy as np
pvt = df.pivot_table(values='業績目標90', index='部門名稱', aggfunc=np.median)
pvt

           業績目標90
部門名稱
業務一課   86920000.0
業務三課  100000000.0
業務二課   74930000.0
業務四課   89100000.0

In [40]:
#Pandas Pivot Table填補遺漏值
pvt = df.pivot_table(values='業績目標90', index='部門名稱', columns='主管姓名',aggfunc = sum, fill_value=0)
pvt

主管姓名         朱金倉         林鵬翔         陳曉蘭         陳雅賢
部門名稱
業務一課           0           0  2173000000           0
業務三課  3100000000           0           0           0
業務二課           0           0           0  1423670000
業務四課           0  3207600000           0           0

In [39]:
#Pandas Pivot Table小計及總計
pvt = df.pivot_table(values='業績目標90', index='部門名稱', columns='主管姓名', aggfunc = sum,fill_value=0, margins=True)
pvt

主管姓名         朱金倉         林鵬翔         陳曉蘭         陳雅賢           All
部門名稱
業務一課           0           0  2173000000           0  2.173000e+09
業務三課  3100000000           0           0           0  3.100000e+09
業務二課           0           0           0  1423670000  1.423670e+09
業務四課           0  3207600000           0           0  3.207600e+09
All   3100000000  3207600000  2173000000  1423670000  9.904270e+09

In [21]:
pvt = df.pivot_table(values='業績目標90', index=['部門名稱', '主管姓名'], columns='姓名', fill_value=0, margins=True)
pvt

,姓名,向大鵬,吳國信,吳美成,張志輝,朱金倉,李進祿,林玉堂,林鳳春,林鵬翔,毛渝南,王玉治,莊國雄,謝穎青,郭曜明,陳曉蘭,陳雅賢,All
部門名稱,主管姓名,,,,,,,,,,,,,,,,,
業務一課,陳曉蘭,0,0,86920000,0,0,0,0,86920000,0,0,86920000,0,0,0,86920000,0,8.692000e+07
業務三課,朱金倉,0,0,0,100000000,100000000,0,100000000,0,0,0,0,0,100000000,0,0,0,1.000000e+08
業務二課,陳雅賢,74930000,74930000,0,0,0,0,0,0,0,0,0,74930000,0,0,0,74930000,7.493000e+07
業務四課,林鵬翔,0,0,0,0,0,89100000,0,0,89100000,89100000,0,0,0,89100000,0,0,8.910000e+07
All,,74930000,74930000,86920000,100000000,100000000,89100000,100000000,86920000,89100000,89100000,86920000,74930000,100000000,89100000,86920000,74930000,8.922766e+07

In [41]:
import numpy as np
pvt = df.pivot_table(values=['業績', '業績目標90'], 
                     index=['部門名稱', '主管姓名', '姓名'], 
                     fill_value=0, 
                     margins=True, 
                     aggfunc = "sum")
pvt

                      業績      業績目標90
部門名稱 主管姓名 姓名
業務一課 陳曉蘭  吳美成   77134650   608440000
          林鳳春   70161300   521520000
          王玉治   24225690   521520000
          陳曉蘭   41242150   521520000
業務三課 朱金倉  張志輝   49453610   500000000
          朱金倉  101364940  1200000000
          林玉堂   55465540   600000000
          謝穎青  103868250   800000000
業務二課 陳雅賢  向大鵬   27513690   299720000
          吳國信   64682552   299720000
          莊國雄   66217360   524510000
          陳雅賢   61356130   299720000
業務四課 林鵬翔  李進祿   63893210  1158300000
          林鵬翔   82954970   623700000
          毛渝南   69012160   801900000
          郭曜明   38406930   623700000
All            929356260  9552230000

In [42]:
pvt.query('部門名稱 == ["業務四課"]')
#前面是欄位，後面是條件

                     業績      業績目標90
部門名稱 主管姓名 姓名
業務四課 林鵬翔  李進祿  63893210  1158300000
          林鵬翔  82954970   623700000
          毛渝南  69012160   801900000
          郭曜明  38406930   623700000

### MultiIndex取值

In [43]:
pvt.index.get_level_values(0), pvt.index.get_level_values(1), pvt.index.get_level_values(2)
#v0部門名稱 v1主管姓名 v2業務員姓名

(Index(['業務一課', '業務一課', '業務一課', '業務一課', '業務三課', '業務三課', '業務三課', '業務三課', '業務二課',
        '業務二課', '業務二課', '業務二課', '業務四課', '業務四課', '業務四課', '業務四課', 'All'],
       dtype='object', name='部門名稱'),
 Index(['陳曉蘭', '陳曉蘭', '陳曉蘭', '陳曉蘭', '朱金倉', '朱金倉', '朱金倉', '朱金倉', '陳雅賢', '陳雅賢',
        '陳雅賢', '陳雅賢', '林鵬翔', '林鵬翔', '林鵬翔', '林鵬翔', ''],
       dtype='object', name='主管姓名'),
 Index(['吳美成', '林鳳春', '王玉治', '陳曉蘭', '張志輝', '朱金倉', '林玉堂', '謝穎青', '向大鵬', '吳國信',
        '莊國雄', '陳雅賢', '李進祿', '林鵬翔', '毛渝南', '郭曜明', ''],
       dtype='object', name='姓名'))

In [ ]:
pvt.columns

Index(['業績', '業績目標90'], dtype='object')

In [44]:
pvt.loc['業務四課', '林鵬翔', '李進祿']

業績          63893210
業績目標90    1158300000
Name: (業務四課, 林鵬翔, 李進祿), dtype: int64

# 14.Sparkline 迷你走勢圖

In [1]:
pip install sparklines

Note: you may need to restart the kernel to use updated packages.

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000287D8435E40>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sparklines/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000287D8436140>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sparklines/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000287D8436470>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sparklines/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000287D8436620>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sparklines/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x00000287D84367D0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/sparklines/
ERROR: Could not find a version that satisfies the requirement sparklines (from versions: none)
ERROR: No matching distribution found for sparklines
WARNING: There was an error checking the latest version of pip.

In [49]:
from sparklines import sparklines
for line in sparklines([1, 2, 3, 4, 5, None, 3, 5, 2]):
    print(line)

ModuleNotFoundError: No module named 'sparklines'

In [51]:
from sparklines import sparklines
import pandas as pd

def sparkliness(l):
    return sparklines(l)[0]

data = [
    [10,'Direct Sales','01-01-2019'],
    [12,'Direct Sales','02-01-2019'],
    [11,'Direct Sales','03-01-2019'],
    [15,'Direct Sales','04-01-2019'],
    [12,'Direct Sales','05-01-2019'],
    [20,'Online Sales','01-01-2019'],
    [25,'Online Sales','02-01-2019'],
    [22,'Online Sales','03-01-2019'],
    [30,'Online Sales','04-01-2019'],
    [23,'Online Sales','05-01-2019'],
]
df = pd.DataFrame(data, columns=['Revenue','Department','Date'])
pvt = df.pivot(index='Department', columns='Date', values='Revenue')
pvt['Trend'] = pvt.apply(sparkliness, axis=1)
pvt

ModuleNotFoundError: No module named 'sparklines'

# Data URI
- data:\[\<mime type\>\]\[;charset=\<charset\>\]\[;\<encoding\>\],\<encoded data\>

- \[;charset=\<charset\>\]\[;\<encoding\>\]
    - data:,
    - data:text/plain,
    - data:text/html,
    - data:text/html;base64,
    - data:text/css,
    - data:text/css;base64,
    - data:text/javascript,
    - data:text/javascript;base64,
    - data:image/gif;base64,
    - data:image/png;base64,
    - data:image/jpeg;base64,
    - data:image/x-icon;base64
    
# Data URI 實際使用
    - 特別注意:在使用的時候記得要把 "data:" 放進去
    - <img src="data:image/png;base64,xxxxxxxxxxxx" alt=""/>
    -                                  轉換成二進制

In [2]:
import pandas as pd

# 關閉最大列寬，這樣圖像就不會被截斷
#pd.set_option('display.max_colwidth', -1)
 
# 關閉max列會顯示所有數據
#pd.set_option('display.max_seq_items', 3)
 
# 修補數據框以便顯示迷你圖功能
#_repr_html_方法是在Jupyter Notebook環境下，當用戶請求以HTML格式顯示一個對象時，會被自動調用。Pandas使用這個方法將DataFrame或Series對象轉換為HTML表格，並將其呈現在Jupyter Notebook中。
#通常情況下，Pandas會默認調用_repr_html_方法來呈現DataFrame或Series對象。但是，有時候用戶需要自定義呈現方式，可以通過重載_repr_html_方法來實現。用戶可以在自定義的_repr_html_方法中生成自己想要的HTML代碼，並將其返回給Pandas，Pandas會將其呈現在Jupyter Notebook中。
#需要注意的是，_repr_html_方法只對Jupyter Notebook有效，如果在其他環境下使用，會報錯或者沒有效果。
pd.DataFrame._repr_html_ = lambda self: self.to_html(escape=False)

def sparkline(data, figsize=(4, 0.25), **kwargs):
    """
    creates a sparkline
    """
    from matplotlib import pyplot as plt
    import base64
    from io import BytesIO

    data = list(data)

    *_, ax = plt.subplots(1, 1, figsize=figsize, **kwargs)
    ax.plot(data)
    ax.fill_between(range(len(data)), data, len(data)*[min(data)], alpha=0.1)
    ax.set_axis_off()

    img = BytesIO()
    plt.savefig(img)
    plt.close()
    return '<img src="data:image/png;base64, {}" />'.format(base64.b64encode(img.getvalue()).decode())

data = [
    [10,'Direct Sales','01-01-2019'],
    [12,'Direct Sales','02-01-2019'],
    [11,'Direct Sales','03-01-2019'],
    [15,'Direct Sales','04-01-2019'],
    [12,'Direct Sales','05-01-2019'],
    [20,'Online Sales','01-01-2019'],
    [25,'Online Sales','02-01-2019'],
    [22,'Online Sales','03-01-2019'],
    [30,'Online Sales','04-01-2019'],
    [23,'Online Sales','05-01-2019'],
]
df = pd.DataFrame(data, columns=['Revenue','Department','Date'])
pvt = df.pivot(index='Department', columns='Date', values='Revenue')
pvt['Trend'] = pvt.apply(sparkline, axis=1)
pvt

Date,01-01-2019,02-01-2019,03-01-2019,04-01-2019,05-01-2019,Trend
Department,,,,,,
Direct Sales,10,12,11,15,12,"<img src=""data:image/png;base64, iVBORw0KGgoAAAANSUhEUgAAAZAAAAAZCAYAAAAfd3hoAAAAOXRFWHRTb2Z0d2FyZQBNYXRwbG90bGliIHZlcnNpb24zLjcuMCwgaHR0cHM6Ly9tYXRwbG90bGliLm9yZy88F64QAAAACXBIWXMAAA9hAAAPYQGoP6dpAAAGTklEQVR4nO2c2XLaZhiGXwkhgTbbLLZImjR2pmPSO+gN9KjX0PvoQWd6RT3tfdQ4nXSbegHbYLARaENI6oEWJCOc2LFNwN8zo9EPksY/M6DH3/KLCYIgAEEQBEHcEXbZEyAIgiBWExIIQRAEcS+4ZU+AIIjVwnY9fDgf4aA9RKs9RKszxIfzEVwvAMMALzbK2KtL2K2F215dxl5NwovNMgoss+zpEw8IQzUQgiAWYbse/jjT0eroaJ0OcdAe4s+LEab+/G2DY5nc92P4Aouvq2IolrqEtzUZu5FoqhIPhiG5rBokEIIgAISyeH+mo9Ue4iCSxV/dMbwcKWyUi2hqCvY1BU1NwbuGisZGCdemi6OBieOBiZOBieN+NL4y4XqLbzVKicNeLY5a5EwEIwmUKPlSIYEQxDPEmnh4fxaLQsdhZ7EsNstFNBsKmpqKpqag2VCgqaU7RQyeH+BCt3Gckkq8nQ9t3HYT2lGFRCxvU2J5VRFRLFAZd5mQQAhizTGc6SyyiOoWf3fHyMs2bYlFNBuhKN5pKpoNBduK8KjpJWfq4XRgZaQSRzBXprvwugLL4HUlTIntRWmxcCxjR33cORMhJBCCWCMMZ4rDjp6I4qA9xD+9MfJ+5VWJR7OhYH9HSaTx2LK4K7rlzkklHtuuv/A6kS/gTTWutcRykbFbk7BRLj7hJ1hvSCAEsaKMbBeHnWxk8e+lkSuLmsxnUlBNTUVdEZ5+0g9EEATojZ25dNjxwETnyoZ3y22tKvFRd9hMKnt1Ca8rIkrFwhN+itWHBEIQK4Buu2i1hzhs6xlZ5FFXhFAU2iyyqMmrK4u7MvV8dK5tHA2MTM3lZGChN3YWXscwwMvNctJ2vJvaqAU5HxIIQXxhDC0Xh1FUEcviv76Ze+6OKqCpqUk3VFNTUH1GsrgrhjPF6ZWFo76RSOV4YOJoYMBwvIXX8RyLN1URe6nW41gylWfcgkwCIYglcm1O0EpFFa3OEEcLZKGppUwKal9TUJH4J57xehIEAa5MF0d9I5FKvJ1+pAVZLXHZqCXVKSby692CTAJ5xgRBgGvTRXfk4EK30R056I5sdHUHfWMCgWMh8QVIAhdu0ViOXwvRMX72WuAoh7yIK2MSiqIzK3CfDKzccxsbpUwKqqkp2BRJFssgbkE+6s93iX2sBVlTS8malp9/+HbtaiwkkDUk/m8qlsKFbqMXS0IPJXGhO+iNHEy8xZ0s96FYYFJSKcyNZYGDyHOQc+QzOzY7X+DYlUwPDGJZpBblta/zZfFyszxblNdQ0NxRsSFSp9AqYLse2ldWsngyvYDy2pq1ICsCh99/+X4lv8u3QQJZIXw/wMCcJGLo6U5GEt2Rg65uozd2bg25b7JRLqIuC6jKPGqKgJrMY0vk4Xo+zIkXbVOYjgfT9WA6U5gTD5brwYjGzvRhRRRTYBlIfCSXKPKRhcKcaGIRZY9Fx5NjHErFhxfS5dgJZRGJ4rCjL5TFV1vlKKJQE2mo1Fa6lgwtN2k7LrAMfvzuzbKn9OCQQL4APD9A33CS6KCrO7iIx5EUuqMwYrjtWUM32RKLqMpCIodkrwioyqEoqpIAnvv81bxT34c98WFMIrlE0jGivTXxwrEzheWGUorlY0WSSl9ruYsLmp8DyyAT9dyMgpIUXTqCupG+642cTIH7bGjn/q1XlfKsdTaShVIiWTw3GAbYVkrLnsajQAJ5RKaej74xyaSNZumj2evL8ST3ERJ5MAA2xWIigbQcarKAmsKjJguoSPxKP+bB8wNY7kxEsXDS8rFcL4yKIvlY6WgpZ/xYMABeV8RZCkpTsb+jQC6tdwGV+DRIIESGqefjcjyZSx/1bkiiP3ZyHxeRB8sAW+IshVSLhZAeKzwqIg9uhcWwLPwggO168ym5W4RzcxxHURJfCCOLRhhZfLOjQKYH/hELWGeB0Lc+hev56I2cuZpCNoJw0Dec3NW+ebAMUJVSqSMpEsINUWxJRXAsieGxYBkGIs+tfVslQTwlz/bXNPV8/PTrQaZLqW9MPvn6AsOgkq4rxEXolBzqsoBNkacVrARBrCXPViBcgcVvrXOMnWn2fZZBXQlrC3U13G8rpfA9RcB2tK+IPFgSA0EQH2HNOnczUA2EIAiCuBeUdCcIgiDuBQmEIAiCuBf/A7E5NPyiA1B/AAAAAElFTkSuQmCC"" />"
Online Sales,20,25,22,30,23,"<img src=""data:image/png;base64, iVBORw0KGgoAAAANSUhEUgAAAZAAAAAZCAYAAAAfd3hoAAAAOXRFWHRTb2Z0d2FyZQBNYXRwbG90bGliIHZlcnNpb24zLjcuMCwgaHR0cHM6Ly9tYXRwbG90bGliLm9yZy88F64QAAAACXBIWXMAAA9hAAAPYQGoP6dpAAAGGUlEQVR4nO2c7W7aZhiGbwM2tsE2pKW223XSNjXQfzuA/dzh7Awm7Zw27Sj2c6GduiVpteGkDTRg8AdgwPvx2hgnJl9NwtdzScgGWcnbFnzx3LddLgzDEARBEARxS3KrXgBBEASxmZBACIIgiDtRWPUCCILYLIbBFO8+DnBg2WhaNponNt59HCCYhijkOHxbK2FfV9AwlGir4quqhFyOW/XSiXuGow6EIIhlDIMp/jrto3nSR7Nl48Cy8fenASazy6eNQo7LfB0AZCGPV7qCul5G3VBR1xXUDQVPywI4jsSyqZBACIIAwGTx9rSPpmXjIJLFP2cOphlS0CQeDUNBw2QTRsNQYGoizgYjHLUdHJ25bNt28KHjYTydZf7OvZIwl0k9mljqhoJykcKRTYAEQhA7iD+e4u1pLAomjcN2tiyqMj+XRMNkJ3hDFW88OUxmM7TO/UgoiVha5z6WnXxeVCQWgRlJFPZdrQyhQLXtOkECIYgtxx1Nkski6i0OzxxkpU1VmUfDZLJ4bahomAqeKcUHiZmGwRTvOy6O2y4O2w6Oo8ml7Ywyjy/kOHzztMSmlWhSoX5ltZBACGKLcEYTvD3pz0VxYNk4ajvI+pQ/KQmpCKphKqiVH0YWt8H2AyaTtoujM2c+uTijSebx1K+sDhIIQWwog2GANyfJZHFg2XjfcTNlUSsXWfykJ71FTSk+/qLvSBiG1K+sISQQgtgA+sOAXTJr2WhGncVxx808tqYU2URhKGiYKl4bCp6UN0cWt4H6ldVCAiHmOKMJWl0PVtfHp/4IpWIeFVlAVeZRlQVUZB7lYoFigQfG9gO8WZgqmpaND5+9zGN1tZguuPXtlcVtuI9+pW4oeFmVqV+5AhLIDtEfBrC6PlpdH62uN99aPfZazwuu/Rl8noMmpaWyVxIuiaZaYs8rsoCKxKOQp293WfS8MZpWurP49zxbFqYmRsVx0ltUS8Ijr3izuW2/IvF57OvleQTWMFTsG+W16IrWARLIFmH7wYIY/EgWiSj6w+wPySKqVICpSqgpRfjBFLYfwPYD9P0Ao0l21nwTFLGAqpxIpTqXzOJraflIfH6rPqRdd8xEcZLI4r9zP/NYUxPnEVQcR1VkksVDkOpXIrEct12877hX9iv7epkJRY87ljIUkX/k1a8WEsiGEIZhJIiLE0QyRQxuIAhN4mFqIntUJJiqCLMiwtQkGJp4ZcE4XBCK7QXJvh+gt7DfX9i/yZqWIRRy6alGZpPOXinZTwlJFqBKPPJrEDmcx7JYuCnP6mXLIs7k43ssGroKTd6tE9E6MpnNYHV9HEZCYVGYi1bXy7wEGmD/lnH8tQv9CglkTQjDED0vWBovtbr+0jF7karMw9QkmJoIY0EUz6PnsvC4V6BMZjMM/ElKNpce3uXXlv2XGNfBcUySaemwLYva0q/F+yKfv/OfseOMmCxaSWdxYg8zj/2qKqUiqLqhQJVIFpvEMJjiw2c3dTXYUdtFe3B1v/LbTz9AEu7+PltHSCCPRBiGOHfHSbzU8y5NE954eu3P2SsJyQQRicKsiDBU9nwb3qBhGMIbTy9Jpe8H6GXIJn7c5O9vGRKfT6aZEn+h02FTTxyznbsjHLT68yjqdIksXu5JScEdyWLXIo5dYrFfOW47ODxL+pVnShF//Pzjqpd475BA7okwDNFxxhemBm+hi/DhB9ef4J6UhHmkdFEUhiZ+0TflbSeYzlLx2Txey5BOf76dYPqFHwEOwNd7Mostonss6rqCskj3G+w6YRii7YwwnQHfv6ysejn3DgnkhsRvhItTg7UQNQ2D60vmWrkYCSKOmJgcnmsSdK2IYoEE8ZjMwhDuKCNi81ivkyUkic+zycJkk8UrnW5OI5bDccAzRVz1Mh4EEkjEbBYLYjFa8uf3RbR6PsbXXIXEgd3EZURCiOOluKA2VHFryzSCILLZZoHs7Nem8WSGX35tRn0EmySWXbIXk+OYILLiJbMiQldF8HS/A0EQO8LOCoTPc/j9z9PUlU05DjA0ES8qEp5XJLxYfFQlEgRBELdmi25lugRFWARBEMSdoK/TBEEQxJ0ggRAEQRB34n8qh1nwFfqB0wAAAABJRU5ErkJggg=="" />"

In [ ]:
!pip install pypng
!pip install pyqrcode

In [13]:
import pyqrcode
import io
import base64

from IPython.display import display, HTML

c = pyqrcode.create("hello python")
s = io.BytesIO()
c.png(s,scale=6)
encoded = base64.b64encode(s.getvalue()).decode("ascii")

display(HTML('''<img src="data:image/png;base64,''' + encoded + '''">'''))

# 15.DataFrame 加減乘除
- [pandas.DataFrame.add](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.add.html)、[pandas.DataFrame.sub](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sub.html)、[pandas.DataFrame.mul](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.mul.html)、[pandas.DataFrame.div](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.div.html)
- 若index不同，則無法正常加減乘除，需將索引設定相同，多層索引 MultiIndex.from_tuples、MultiIndex.from_arrays、MultiIndex.from_product、MultiIndex.from_frame
- 應用如財報第四季計算是以年到減去前三季

In [3]:
import pandas as pd
import numpy as np

n = 5
val = np.random.randint(n * 10, size = (n, n))
df1 = pd.DataFrame(val, columns = [chr(97 + _) for _ in range(n)])
df1

    a   b   c   d   e
0  30  47  25  20  48
1   6  26  37  22  23
2  22  17  16  22  37
3   4  27  48  20  16
4  16  42  15  36  48

In [4]:
val = np.random.randint(n * 10, size = (n, n))
df2 = pd.DataFrame(val, columns = [chr(97 + _) for _ in range(n)])
df2

    a   b   c   d   e
0  28  14  47  35  48
1  32  13  32   9  23
2   3   2   5  28  47
3  26  15  11  35  21
4  38  33  21   5  41

In [5]:
df1 + df2

    a   b   c   d   e
0  58  61  72  55  96
1  38  39  69  31  46
2  25  19  21  50  84
3  30  42  59  55  37
4  54  75  36  41  89

In [6]:
df1.add(df2)

    a   b   c   d   e
0  58  61  72  55  96
1  38  39  69  31  46
2  25  19  21  50  84
3  30  42  59  55  37
4  54  75  36  41  89

### 實際例子

In [21]:
def remove0(x):
    if len(str(x)) == 3 and x == 0.0:
        x = ""
    return x

year = 2022
file = r'財報\basi_incomestatement.csv'
df = pd.read_csv(file, na_filter = False, dtype = {'股票代號':object})

#限制在Q4資料出現再計算
idx = df.columns.tolist().index('報告別')
l = df.groupby('年季')['年季'].nunique().index.tolist()

for _ in list(filter(lambda x:x.find('Q4') > -1, l)):
    allq = list(filter(lambda x:x.find(_[:5]) > -1, l))
    for yy in set(list(map(lambda x:x[:4], allq))):
        #print(yy, "{}Q{}".format(yy, 4))
        q4 = df[df['年季'] == "{}Q{}".format(yy, 4)]                             
        q4 = q4.applymap(lambda x: pd.to_numeric(x, errors='ignore', downcast = 'float'))
        q4['股票代號'] = q4['股票代號'].apply(lambda x:str(x).replace('.0', ''))
        
        if len(q4) > 0:                    
            source_index, source_columns = q4.index, q4.columns                    
            q4 = q4.set_index(['股票代號', '財報別', '報告別'])                    
            q4 = q4.applymap(lambda x: pd.to_numeric(x, errors='ignore'))#coerce                    
            q4 = q4.replace("nan", 0).replace(np.nan, 0) #為了型別轉換補0

            #將前3季的資料去減第4季                    
            for i in range(1, 4):
                q = df[df['年季'] == "{}Q{}".format(year, i)]
                q['股票代號'] = q['股票代號'].apply(lambda x:str(x).replace('.0', ''))
                q = q.set_index(['股票代號', '財報別', '報告別'])                                                
                q = q.applymap(lambda x: pd.to_numeric(x, errors='ignore'))
                q = q.replace("nan", 0).replace(np.nan, 0) #為了型別轉換補0

                q4.iloc[:, 1:] = q4.iloc[:, 1:].sub(q.iloc[:, 1:], fill_value = 0)
                q4.iloc[:, 1:] = q4.iloc[:, 1:].replace("nan", 0).replace(np.nan, 0) #為了型別轉換補0

            q4.reset_index(inplace = True)
            q4 = q4[source_columns]
            q4.index = source_index

            #刪除Q4資料
            df = df.drop(index = df[df['年季'] == "{}Q{}".format(year, 4)].index.tolist())
            #將新的Q4資料合併至表格中
            df = pd.concat([df, q4], ignore_index = True)
            #格式化小數位數
            idx = df.columns.tolist().index('報告別')
            #取代0.0為空白
            df = df.applymap(remove0)

            df.iloc[:, idx+1:] = df.iloc[:, idx+1:].applymap(lambda x: pd.to_numeric(x, errors='coerce'))
            #print(df.info())
            df.iloc[:, idx+1:] = df.iloc[:, idx+1:].applymap(lambda x:'{:.2f}'.format(x))
df = df.replace(np.nan, "").replace("nan", "")
df

C:\Users\User\AppData\Local\Temp\ipykernel_8316\2980034947.py:31: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  q['股票代號'] = q['股票代號'].apply(lambda x:str(x).replace('.0', ''))
C:\Users\User\AppData\Local\Temp\ipykernel_8316\2980034947.py:36: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  q4.iloc[:, 1:] = q4.iloc[:, 1:].sub(q.iloc[:, 1:], fill_value = 0)
C:\Users\User\AppData\Local\Temp\ipykernel_8316\2980034947.py:31: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  q['股票代號'] = q['股票代號'].apply(lambda x:str(x).replace('.0', ''))
C:\Users\User\AppData\Local\Temp\ipykernel_8316\2980034947.py:31: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  q['股票代號'] = q['股票代號'].apply(lambda x:str(x).replace('.0', ''))
C:\Users\User\AppData\Local\Temp\ipykernel_8316\2980034947.py:52: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.iloc[:, idx+1:] = df.iloc[:, idx+1:].applymap(lambda x: pd.to_numeric(x, errors='coerce'))

,年季,股票代號,財報別,報告別,41000,49020,51000,58200,58400,61001,...,66000,67101,67105,67111,67301,67305,67311,67500,67700,4XXXX
0,2022Q1,2801,fr1,cr,7304860.00,1978438.00,1853608.00,557306.00,4053988.00,2818396.00,...,1612824.00,2377142.00,,,1612824.00,,,0.23,0.23,7429690.00
1,2022Q1,2809,fr1,cr,1693820.00,-861601.00,231671.00,-80904.00,484973.00,196479.00,...,-2041721.00,36641.00,,,-2041721.00,,,0.03,0.03,600548.00
2,2022Q1,2812,fr1,cr,3162409.00,1019878.00,744793.00,217869.00,1657132.00,1562493.00,...,1107765.00,1276014.00,,,1107765.00,,,0.28,0.28,3437494.00
3,2022Q1,2834,fr1,cr,6367825.00,1521781.00,1676793.00,255260.00,3368433.00,2589120.00,...,857719.00,2124261.00,0.00,0.00,857719.00,0.00,0.00,0.27,0.27,6212813.00
4,2022Q1,2837,fr1,cr,3003202.00,784005.00,621713.00,-106482.00,1664572.00,1607404.00,...,-1001398.00,1358755.00,,4339.00,-1007694.00,,6296.00,0.29,,3165494.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
169,2022Q4,5870,fr1,ir,-700317.00,27511.00,139991.00,-405814.00,-4533160.00,4126177.00,...,2813230.00,,,,,,,0.45,0.45,-812797.00
170,2022Q4,5872,fr1,ir,5136187.00,4988625.00,2310821.00,-195614.00,4642173.00,3367432.00,...,3620320.00,,,,,,,0.80,,7813991.00
171,2022Q4,5875,fr1,ir,5169825.00,1908240.00,2395146.00,179753.00,4439253.00,63913.00,...,43622.00,,,,,,,0.03,0.03,4682919.00
172,2022Q4,6031,fr1,ir,320031.00,-99872.00,249103.00,103400.00,964027.00,-1096371.00,...,-871689.00,,,,,,,-0.28,-0.28,-28944.00
173,2022Q4,5850,fr2,cr,1338703.00,394500.00,407329.00,-62264.00,781618.00,606520.00,...,584316.00,536420.00,,2.00,584314.00,,2.00,0.29,,1325874.00

In [19]:
df[df['股票代號'] == '2837']

,年季,股票代號,財報別,報告別,41000,49020,51000,58200,58400,61001,...,66000,67101,67105,67111,67301,67305,67311,67500,67700,4XXXX
4,2022Q1,2837,fr1,cr,3003202.00,784005.00,621713.00,-106482.00,1664572.00,1607404.00,...,-1001398.00,1358755.00,nan,4339.00,-1007694.00,nan,6296.00,0.29,nan,3165494.00
32,2022Q2,2837,fr1,cr,3458076.00,949983.00,977519.00,-48035.00,1706272.00,1772303.00,...,-1930188.00,1515861.00,nan,4344.00,-1934231.00,nan,4043.00,0.33,nan,3430540.00
77,2022Q3,2837,fr1,cr,4284200.00,1240754.00,1797624.00,-13950.00,1739929.00,2001351.00,...,-764493.00,1853012.00,nan,5365.00,-769702.00,nan,5209.00,0.40,nan,3727330.00
105,2023Q1,2837,fr1,cr,5272215.00,1423880.00,3287279.00,-93271.00,1733093.00,1768994.00,...,2400925.00,1534630.00,nan,0.00,2400925.00,nan,0.00,0.33,nan,3408816.00
132,2022Q4,2837,fr1,cr,5111344.00,743143.00,2919247.00,-40719.00,1705314.00,1270645.00,...,2699549.00,1272382.00,nan,953.00,2698596.00,nan,953.00,0.28,nan,2935240.00

# 16.時間序列處理
### 16-1 Pandas支援4種日期時間

|時間概念|說明|類別|索引類別|Pandas資料類型|建立方法|
|-|-|-|-|-|-|
|日期時間(時間戳)|帶時區的日期時間，類似於標準庫的datetime.datetime|Timestamp|DatetimeIndex|datetime64[ns]、datetime64[ns,tz]|pd.to_datetime、pd.date_range、pd.bdate_range、pd.Timestamp、pd.DatetimeIndex|
|時間增量(時間差Timedelta)|絕對時間週期，類似於標準庫的datetime.timedelta|Timedelta|TimedeltaIndex|timedelta64[ns]|pd.to_timedelta、pd.timedelta_range|
|時間跨度(時間段Timespan)|在某一時點以指定頻率定義的時間跨度|Period|PeriodIndex|period[freq]|pd.period、pd.period_range、pd.PeriodIndex|
|日期偏移(Dateoffset)|與日曆運算對應的時間段，類似於 dateutil 的dateutil.relativedelta.relativedelta|DateOffset|None|None|pd.DateOffset|

- [pd.to_datetime](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html)
    - 轉換時間序列
    - pd.to_datetime(arg,errors ='raise', utc = None, format = None, unit = None )
        - **format**：格式化顯示時間的格式。如"%Y-%m-%d",.....
        - **units**：預設值為'ns'，精確到微妙，'s'為秒。
        - **errors**：三種取值，'ignore', 'raise', 'coerce'，預設為raise。
            * raise，則無效的解析將引發異常
            * coerce，那麼無效解析將被設置為NaT
            * ignore，那麼無效的解析將返回輸入值
- [pd.to_timedelta](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_timedelta.html)
    - 轉換成時間差
- [pd.date_range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html)
    - 產生等差時間序列，有時間範圍限制，超出的時間要用 pd.period_range 進行序列建立
    - pd.date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs)
        - start：開始時間 
        - end：結束時間 
        - periods：總數量長度 
        - freq：時間間隔、日期偏移量，預設'D' 
        - tz：時區 
        - normalize：是否標準化到 
        - midnight：午夜時間戳記 
        - name：列名稱 
        - closed：首尾是否在內 'left'、'right'
- [pd.bdate_range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.bdate_range.html)
    - 產生工作日的時間序列
    - pd.bdate_range：(start=None, end=None, periods=None, freq='B', tz=None, normalize=True, name=None, weekmask=None, holidays=None, closed=_NoDefault.no_default, inclusive=None, **kwargs)
- [pd.period_range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.period_range.html)
    - 產生週期序列
    - pd.period_range(start=None, end=None, periods=None, freq=None, name=None)    
        - start：開始時間 
        - end：結束時間 
        - periods：總數量長度 
        - freq：時間間隔、日期偏移量，預設'D' 
        - name：列名稱
- [pd.timedelta_range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.timedelta_range.html)
    - 產生時間差序列
    - pd.timedelta_range(start=None, end=None, periods=None, freq=None, name=None, closed=None)
- [pd.interval_range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.interval_range.html)
    - 產生時間區間、數值區間
    - pd.interval_range(start=None, end=None, periods=None, freq=None, name=None, closed='right')

![](image\pandas_date_range.png)

In [ ]:
#時間範圍
pd.Timestamp.min, pd.Timestamp.max

(Timestamp('1677-09-21 00:12:43.145224193'),
 Timestamp('2262-04-11 23:47:16.854775807'))

In [ ]:
pd.date_range('1510-10-01', periods=10, freq='D')

OutOfBoundsDatetime: Out of bounds nanosecond timestamp: 1510-10-01 00:00:00

In [ ]:
pd.period_range('1510-10-01', periods=10, freq='D')

PeriodIndex(['1510-10-01', '1510-10-02', '1510-10-03', '1510-10-04',
             '1510-10-05', '1510-10-06', '1510-10-07', '1510-10-08',
             '1510-10-09', '1510-10-10'],
            dtype='period[D]')

- pd.timedelta_range(start=None, end=None, periods=None, freq=None, name=None, closed=None)

In [ ]:
pd.timedelta_range(start = '1 day', periods = 3, freq = '5h')

TimedeltaIndex(['1 days 00:00:00', '1 days 05:00:00', '1 days 10:00:00'], dtype='timedelta64[ns]', freq='5H')

- pd.interval_range(start=None, end=None, periods=None, freq=None, name=None, closed='right')

In [ ]:
#時間區間
pd.interval_range(pd.Timestamp("2020-1-15"), pd.Timestamp("2020-3-15"))

IntervalIndex([(2020-01-15, 2020-01-16], (2020-01-16, 2020-01-17], (2020-01-17, 2020-01-18], (2020-01-18, 2020-01-19], (2020-01-19, 2020-01-20] ... (2020-03-10, 2020-03-11], (2020-03-11, 2020-03-12], (2020-03-12, 2020-03-13], (2020-03-13, 2020-03-14], (2020-03-14, 2020-03-15]], dtype='interval[datetime64[ns], right]')

In [ ]:
#數值區間
pd.interval_range(0, 10)

IntervalIndex([(0, 1], (1, 2], (2, 3], (3, 4], (4, 5], (5, 6], (6, 7], (7, 8], (8, 9], (9, 10]], dtype='interval[int64, right]')

### 16-2 範例

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datagy/data/main/time_data.csv', parse_dates=['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 337 entries, 0 to 336
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         337 non-null    object
 1   Close Price  337 non-null    float64
 2   High Price   337 non-null    float64
 3   Low Price    337 non-null    float64
 4   Open Price   337 non-null    float64
 5   Volume       337 non-null    float64
dtypes: float64(5), object(1)
memory usage: 15.9+ KB

In [2]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datagy/data/main/time_data.csv', parse_dates=[0])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 337 entries, 0 to 336
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         337 non-null    object
 1   Close Price  337 non-null    float64
 2   High Price   337 non-null    float64
 3   Low Price    337 non-null    float64
 4   Open Price   337 non-null    float64
 5   Volume       337 non-null    float64
dtypes: float64(5), object(1)
memory usage: 15.9+ KB

### 方法1

In [3]:
import datetime as dt
df['Date'] = df['Date'].apply(lambda x:dt.datetime.strptime(x, '%Y-%m-%d %H%p'))
df.head()

,Date,Close Price,High Price,Low Price,Open Price,Volume
0,2021-12-10 05:00:00,48246.57,48359.35,48051.08,48170.66,827.39761
1,2021-12-10 06:00:00,47847.59,48430.00,47810.81,48249.78,1296.18883
2,2021-12-10 07:00:00,47694.62,48037.48,47550.00,47847.59,2299.85298
3,2021-12-10 08:00:00,48090.35,48169.06,47587.39,47694.62,1371.25447
4,2021-12-10 09:00:00,48366.37,48495.00,47869.80,48090.35,1232.30238

### 方法2

In [4]:
df['Date'] = pd.to_datetime(df['Date'], format='%Y-%m-%d %H%p')
df.head()

,Date,Close Price,High Price,Low Price,Open Price,Volume
0,2021-12-10 05:00:00,48246.57,48359.35,48051.08,48170.66,827.39761
1,2021-12-10 06:00:00,47847.59,48430.00,47810.81,48249.78,1296.18883
2,2021-12-10 07:00:00,47694.62,48037.48,47550.00,47847.59,2299.85298
3,2021-12-10 08:00:00,48090.35,48169.06,47587.39,47694.62,1371.25447
4,2021-12-10 09:00:00,48366.37,48495.00,47869.80,48090.35,1232.30238

### 方法3
##### [時間轉字串strftime() 與 字串轉時間strptime()](https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior)

In [5]:
import pandas as pd
from datetime import datetime
parser = lambda x: datetime.strptime(x, '%Y-%m-%d %H%p')
df = pd.read_csv('https://raw.githubusercontent.com/datagy/data/main/time_data.csv', parse_dates=['Date'], date_parser=parser)
df.head()

,Date,Close Price,High Price,Low Price,Open Price,Volume
0,2021-12-10 05:00:00,48246.57,48359.35,48051.08,48170.66,827.39761
1,2021-12-10 06:00:00,47847.59,48430.00,47810.81,48249.78,1296.18883
2,2021-12-10 07:00:00,47694.62,48037.48,47550.00,47847.59,2299.85298
3,2021-12-10 08:00:00,48090.35,48169.06,47587.39,47694.62,1371.25447
4,2021-12-10 09:00:00,48366.37,48495.00,47869.80,48090.35,1232.30238

In [6]:
#判別星期幾
df['Date'].dt.day_name()

0      Friday
1      Friday
2      Friday
3      Friday
4      Friday
        ...
332    Friday
333    Friday
334    Friday
335    Friday
336    Friday
Name: Date, Length: 337, dtype: object

In [7]:
df['Date'].max(), df['Date'].min()

(Timestamp('2021-12-24 05:00:00'), Timestamp('2021-12-10 05:00:00'))

In [8]:
df['Date'].max() - df['Date'].min()

Timedelta('14 days 00:00:00')

In [9]:
df = df.set_index('Date')
df.head()

,Close Price,High Price,Low Price,Open Price,Volume
Date,,,,,
2021-12-10 05:00:00,48246.57,48359.35,48051.08,48170.66,827.39761
2021-12-10 06:00:00,47847.59,48430.00,47810.81,48249.78,1296.18883
2021-12-10 07:00:00,47694.62,48037.48,47550.00,47847.59,2299.85298
2021-12-10 08:00:00,48090.35,48169.06,47587.39,47694.62,1371.25447
2021-12-10 09:00:00,48366.37,48495.00,47869.80,48090.35,1232.30238

In [10]:
df.loc['2021-12-10'].head()

,Close Price,High Price,Low Price,Open Price,Volume
Date,,,,,
2021-12-10 05:00:00,48246.57,48359.35,48051.08,48170.66,827.39761
2021-12-10 06:00:00,47847.59,48430.00,47810.81,48249.78,1296.18883
2021-12-10 07:00:00,47694.62,48037.48,47550.00,47847.59,2299.85298
2021-12-10 08:00:00,48090.35,48169.06,47587.39,47694.62,1371.25447
2021-12-10 09:00:00,48366.37,48495.00,47869.80,48090.35,1232.30238

In [11]:
df.loc['2021-12', 'Close Price'].head()

Date
2021-12-10 05:00:00    48246.57
2021-12-10 06:00:00    47847.59
2021-12-10 07:00:00    47694.62
2021-12-10 08:00:00    48090.35
2021-12-10 09:00:00    48366.37
Name: Close Price, dtype: float64

In [12]:
df.loc['2021-12-10':'2021-12-12']

,Close Price,High Price,Low Price,Open Price,Volume
Date,,,,,
2021-12-10 05:00:00,48246.57,48359.35,48051.08,48170.66,827.39761
2021-12-10 06:00:00,47847.59,48430.00,47810.81,48249.78,1296.18883
2021-12-10 07:00:00,47694.62,48037.48,47550.00,47847.59,2299.85298
2021-12-10 08:00:00,48090.35,48169.06,47587.39,47694.62,1371.25447
2021-12-10 09:00:00,48366.37,48495.00,47869.80,48090.35,1232.30238
...,...,...,...,...,...
2021-12-12 19:00:00,50221.05,50600.00,50014.48,50468.71,1283.56200
2021-12-12 20:00:00,50270.58,50547.07,50147.80,50221.05,762.99289
2021-12-12 21:00:00,49950.05,50317.77,49862.75,50266.13,917.78949
2021-12-12 22:00:00,50272.02,50298.99,49920.03,49950.05,749.98746
2021-12-12 23:00:00,50053.90,50358.24,49950.00,50272.02,674.86106

### 16-3 重採樣 resample
#### [DateOffsets](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects)

In [14]:
df = df.resample('D').mean()
df.head()

,Close Price,High Price,Low Price,Open Price,Volume
Date,,,,,
2021-12-10,48121.444737,48509.807895,47808.685789,48175.862632,1948.973259
2021-12-11,48461.897083,48727.740000,48187.683333,48367.873750,1203.716399
2021-12-12,49547.267083,49765.524583,49340.160000,49519.259167,1084.080592
2021-12-13,48138.488333,48478.125417,47835.047917,48278.071667,2119.563372
2021-12-14,47201.301250,47468.922500,46882.182083,47132.922083,1664.832685

In [15]:
df = df.resample('D').agg({'Close Price': 'last', 'High Price': 'max', 'Low Price': 'min','Open Price': 'first','Volume': 'sum'})
df.head()

,Close Price,High Price,Low Price,Open Price,Volume
Date,,,,,
2021-12-10,48121.444737,48509.807895,47808.685789,48175.862632,1948.973259
2021-12-11,48461.897083,48727.740000,48187.683333,48367.873750,1203.716399
2021-12-12,49547.267083,49765.524583,49340.160000,49519.259167,1084.080592
2021-12-13,48138.488333,48478.125417,47835.047917,48278.071667,2119.563372
2021-12-14,47201.301250,47468.922500,46882.182083,47132.922083,1664.832685